---
kind: property
id: P:Autodesk.Revit.DB.Electrical.DistributionSysType.NumWires
source: html/fcd6e824-2bf6-17a8-839c-6d7d11283b9b.htm
---
# Autodesk.Revit.DB.Electrical.DistributionSysType.NumWires Property

Get or set number of wires of distribution system.

## Syntax (C#)
```csharp
public int NumWires { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - While assign a negative value to NumWires.